# NGパターン

* キャプション"自分側の人数"の入力窓に"10"を入力する
* キャプション"相手側の人数"の入力窓に"10"を入力する
* キャプション"金額"の入力窓に"100000"を入力する

## 「自分側の人数」
* "自分側の人数"の人数入力窓にエラー値を入力した場合の挙動が正しいこと

## 「相手側の人数」
* "自分側の人数"の人数入力窓にエラー値を入力した場合の挙動が正しいこと

## 「金額」
### "0"を入力
* "<金額"の入力窓にエラー値"0"を入力した場合エラー"TODO: 中身確認"が表示され「計算する」ボタンがアクティブでなくなること
### "-10"を入力
* "<金額"の入力窓にエラー値"-10"を入力した場合エラー"TODO: 中身確認"が表示され「計算する」ボタンがアクティブでなくなること
### "100"を入力
* "<金額"の入力窓にエラー値"100"を入力した場合エラー"TODO: 中身確認"が表示され「計算する」ボタンがアクティブでなくなること
### "1000"を入力
* "<金額"の入力窓にエラー値"1000"を入力した場合エラー"TODO: 中身確認"が表示され「計算する」ボタンがアクティブでなくなること
### "１"を入力(全角)
* "<金額"の入力窓にエラー値"１"を入力した場合エラー"TODO: 中身確認"が表示され「計算する」ボタンがアクティブでなくなること
